//---------------------------------------------------------------------------------
// ExpInfo.h
//---------------------------------------------------------------------------------
// 이미 화일이 존재하고.. 거기서 읽어온다고 가정했기 때문에.. 
// save함수는 없당..
//---------------------------------------------------------------------------------

#ifndef __EXPINFO_H__
#define __EXPINFO_H__

#include "CTypeTable.h"
ifstream;

//---------------------------------------------------------------------------------
// Exp Info
//---------------------------------------------------------------------------------
class ExpInfo {
	public :
		//int					Level;			// 레벨
		int					GoalExp;		// 그 레벨일때 다음 레벨로 가기위한 목표 경험치
		unsigned int		AccumExp;		// 그 레벨에서 다음레벨로 가기위한 총 경험치.

	public :
		void				LoadFromFile(ifstream& file);		
};

//---------------------------------------------------------------------------------
// Exp Table
//---------------------------------------------------------------------------------
typedef CTypeTable<ExpInfo>		ExpTable;

#endif