//-----------------------------------------------------------------------------
// MZoneSound.h
//-----------------------------------------------------------------------------
// 한 존에서...
//
// [물]
// 두 군데에서 물이 흐른다면..
// 이 두 군데에는 ID가 다르다.
// SoundID는 같다.
// Sector에서 ZoneSoundIDList에서는 
// 두 개의 ID를 모두 가지고 각각의 적절한 Play좌표를 가진다.
// 음.. 말이 복잡군. - -;
//
// [나무]
// 나무가 여러그루있다면... 각각마다 ID가 다르고.. SoundID는 같고..
// Sector에서는 모든 나무의(-_-; 물론 근처의..) ID를 가지겠지.
//
// [개, 늑대 -_-]
// Zone마다 개 마리수.. 늑대 수..만큼(-_-;)의 ID를 두고..
// 각 Tile에는 모든 동물들의 ID가 있어야겠지.. 으흠 - -;
// 머.. 랜덤하게 특정 Tile에만 두는거도 괜찮겠고..
//-----------------------------------------------------------------------------

#ifndef __MZONESOUND_H__
#define __MZONESOUND_H__

#ifdef PLATFORM_WINDOWS
#include <Windows.h>
#else
#include "../../basic/Platform.h"
#endif
#include "MTypeDef.h"
#include "ShowTimeChecker.h"

//-----------------------------------------------------------------------------
// Zone에서의 한 가지 소리에 대한 정보
//-----------------------------------------------------------------------------
class ZONESOUND_INFO : public ShowTimeChecker {
	public :
		ZONESOUND_INFO();
		~ZONESOUND_INFO();

		//---------------------------------------------------------------
		// File I/O
		//---------------------------------------------------------------
		void					SaveToFile(class ofstream& file);
		void					LoadFromFile(class ifstream& file);

	public :
		//---------------------------------------------------------------
		// 고정된 정보들
		//---------------------------------------------------------------
		unsigned short	ID;				// ZoneSound의 ID
		TYPE_SOUNDID	SoundID;		// SoundID
};


#endif

